Repository: bahmankhah/forooshyar
Catalog: languages/forooshyar-*.po
Languages: fa_ir

source: Forooshyar
fa_ir: فروشیار

source: WooCommerce Product API for Third-party Services
fa_ir: API محصولات ووکامرس برای سرویس‌های شخص ثالث

source: Forooshyar Settings
fa_ir: تنظیمات فروشیار

source: API Monitor
fa_ir: مانیتور API

source: Forooshyar Management Panel
fa_ir: پنل مدیریت فروشیار

source: WooCommerce Product API Configuration and Settings
fa_ir: تنظیمات و پیکربندی API محصولات ووکامرس

source: Forooshyar API Monitor
fa_ir: مانیتور API فروشیار

source: Real-time API Response Monitoring and Testing
fa_ir: مشاهده و تست پاسخ‌های API در زمان واقعی

source: General
fa_ir: عمومی

source: Product Fields
fa_ir: فیلدهای محصول

source: Images
fa_ir: تصاویر

source: Cache
fa_ir: کش

source: API Limits
fa_ir: محدودیت‌های API

source: Advanced
fa_ir: پیشرفته

source: Show Variations
fa_ir: نمایش تنوع‌ها

source: Should product variations be included in API responses?
fa_ir: آیا تنوع‌های محصولات در پاسخ API گنجانده شوند؟

source: Title Template
fa_ir: قالب عنوان

source: Template for generating product titles. Use the variables below:
fa_ir: قالب برای تولید عنوان محصولات. از متغیرهای زیر استفاده کنید:

source: Available Variables:
fa_ir: متغیرهای قابل استفاده:

source: Product Name
fa_ir: نام محصول

source: Variation Name
fa_ir: نام تنوع

source: Category
fa_ir: دسته‌بندی

source: Product Code
fa_ir: کد محصول

source: Brand
fa_ir: برند

source: Custom Suffix
fa_ir: پسوند سفارشی

source: Custom text to be added to the end of titles
fa_ir: متن سفارشی که به انتهای عناوین اضافه می‌شود

source: Default Language
fa_ir: زبان پیش‌فرض

source: Persian
fa_ir: فارسی

source: English
fa_ir: انگلیسی

source: Default language for user interface and error messages
fa_ir: زبان پیش‌فرض برای رابط کاربری و پیام‌های خطا

source: API Version
fa_ir: نسخه API

source: Version 1
fa_ir: نسخه ۱

source: API version used in endpoint URLs
fa_ir: نسخه API که در URL نقاط پایانی استفاده می‌شود

source: Debug Mode
fa_ir: حالت اشکال‌زدایی

source: Enable detailed logging for debugging
fa_ir: فعال‌سازی لاگ‌گیری تفصیلی برای اشکال‌زدایی

source: Product Field Selection
fa_ir: انتخاب فیلدهای محصول

source: Select which fields you want to include in API responses. All fields are enabled by default.
fa_ir: فیلدهایی که می‌خواهید در پاسخ‌های API گنجانده شوند را انتخاب کنید. همه فیلدها به طور پیش‌فرض فعال هستند.

source: Core Fields
fa_ir: فیلدهای اصلی

source: Select Product Fields
fa_ir: انتخاب فیلدهای محصول

source: Quick Actions
fa_ir: عملیات سریع

source: Select All
fa_ir: انتخاب همه

source: Deselect All
fa_ir: لغو انتخاب همه

source: Reset to Default
fa_ir: بازگردانی به پیش‌فرض

source: Custom Fields
fa_ir: فیلدهای سفارشی

source: Enter custom fields as JSON
fa_ir: فیلدهای سفارشی را به صورت JSON وارد کنید

source: Additional custom fields to extract from product meta fields. Format: {"field_name": "meta_key"}
fa_ir: فیلدهای سفارشی اضافی که می‌خواهید از متافیلدهای محصول استخراج شوند. فرمت: {"field_name": "meta_key"}

source: Field Mapping
fa_ir: نگاشت فیلدها

source: Enter field mapping as JSON
fa_ir: نگاشت نام فیلدها را به صورت JSON وارد کنید

source: Use to rename fields in API responses. Format: {"old_name": "new_name"}
fa_ir: برای تغییر نام فیلدها در پاسخ API استفاده کنید. فرمت: {"old_name": "new_name"}

source: Invalid JSON format
fa_ir: فرمت JSON نامعتبر است

source: Title
fa_ir: عنوان

source: Subtitle
fa_ir: زیرعنوان

source: Parent ID
fa_ir: شناسه والد

source: Unique Page ID
fa_ir: شناسه یکتای صفحه

source: Current Price
fa_ir: قیمت فعلی

source: Old Price
fa_ir: قیمت قبلی

source: Availability
fa_ir: موجودی

source: Category Name
fa_ir: نام دسته‌بندی

source: Image Links
fa_ir: لینک‌های تصاویر

source: Main Image Link
fa_ir: لینک تصویر اصلی

source: Page URL
fa_ir: آدرس صفحه

source: Short Description
fa_ir: توضیح کوتاه

source: Specifications
fa_ir: مشخصات

source: Date
fa_ir: تاریخ

source: Registry
fa_ir: رجیستری

source: Guarantee
fa_ir: گارانتی

source: Image Sizes
fa_ir: اندازه‌های تصویر

source: Thumbnail
fa_ir: تصویر کوچک

source: Medium
fa_ir: متوسط

source: Large
fa_ir: بزرگ

source: Full Size
fa_ir: اندازه کامل

source: Maximum Images per Product
fa_ir: حداکثر تصاویر هر محصول

source: Image Quality
fa_ir: کیفیت تصویر

source: Compression quality for images (1-100)
fa_ir: کیفیت فشرده‌سازی تصاویر (۱-۱۰۰)

source: Cache Enabled
fa_ir: کش فعال

source: Enable caching for better performance
fa_ir: فعال‌سازی کش برای بهبود عملکرد

source: Cache Duration
fa_ir: مدت زمان کش

source: Cache duration in seconds
fa_ir: مدت زمان کش به ثانیه

source: Auto Invalidate Cache
fa_ir: پاک‌سازی خودکار کش

source: Automatically clear cache when products are modified
fa_ir: پاک‌سازی خودکار کش هنگام تغییر محصولات

source: Cache Storage Location
fa_ir: محل ذخیره‌سازی کش

source: Database
fa_ir: پایگاه داده

source: File System
fa_ir: سیستم فایل

source: Memory (Redis/Memcached)
fa_ir: حافظه (Redis/Memcached)

source: Maximum Products per Page
fa_ir: حداکثر محصولات در هر صفحه

source: Rate Limiting
fa_ir: محدودیت نرخ درخواست

source: Requests per Minute
fa_ir: درخواست در دقیقه

source: Requests per Hour
fa_ir: درخواست در ساعت

source: Request Timeout
fa_ir: مهلت زمانی درخواست

source: Timeout in seconds
fa_ir: مهلت زمانی به ثانیه

source: IP Whitelist
fa_ir: لیست سفید IP

source: Allowed IP addresses (one per line)
fa_ir: آدرس‌های IP مجاز (یکی در هر خط)

source: IP Blacklist
fa_ir: لیست سیاه IP

source: Blocked IP addresses (one per line)
fa_ir: آدرس‌های IP مسدود (یکی در هر خط)

source: Custom Field Mapping
fa_ir: نگاشت فیلدهای سفارشی

source: Database Query Optimization
fa_ir: بهینه‌سازی کوئری پایگاه داده

source: Enable query optimization
fa_ir: فعال‌سازی بهینه‌سازی کوئری

source: Response Compression
fa_ir: فشرده‌سازی پاسخ

source: Enable GZIP compression
fa_ir: فعال‌سازی فشرده‌سازی GZIP

source: Lazy Loading
fa_ir: بارگذاری تنبل

source: Enable lazy loading for heavy data
fa_ir: فعال‌سازی بارگذاری تنبل برای داده‌های سنگین

source: Save Settings
fa_ir: ذخیره تنظیمات

source: Reset to Defaults
fa_ir: بازگردانی به پیش‌فرض

source: Export Settings
fa_ir: صادرات تنظیمات

source: Import Settings
fa_ir: وارد کردن تنظیمات

source: Are you sure you want to reset all settings to default values?
fa_ir: آیا مطمئن هستید که می‌خواهید تمام تنظیمات را به حالت پیش‌فرض بازگردانید؟

source: Settings imported successfully
fa_ir: تنظیمات با موفقیت وارد شد

source: Invalid settings file
fa_ir: فایل تنظیمات نامعتبر است

source: API Test
fa_ir: تست API

source: Endpoint
fa_ir: نقطه پایانی

source: Parameters
fa_ir: پارامترها

source: Required parameters are displayed based on selected endpoint
fa_ir: پارامترهای مورد نیاز بر اساس نقطه پایانی انتخابی نمایش داده می‌شوند

source: Test API
fa_ir: تست API

source: API Response
fa_ir: پاسخ API

source: Response Time:
fa_ir: زمان پاسخ:

source: Cache Status:
fa_ir: وضعیت کش:

source: Status:
fa_ir: وضعیت:

source: Size:
fa_ir: اندازه:

source: Copy
fa_ir: کپی

source: Copied!
fa_ir: کپی شد!

source: Copy failed
fa_ir: خطا در کپی کردن

source: This endpoint has no parameters
fa_ir: این نقطه پایانی پارامتری ندارد

source: Live Statistics
fa_ir: آمار زنده

source: Refresh Statistics
fa_ir: بروزرسانی آمار

source: Total Requests
fa_ir: کل درخواست‌ها

source: Cache Hit Rate
fa_ir: نرخ موفقیت کش

source: Average Response Time
fa_ir: میانگین زمان پاسخ

source: Today's Requests
fa_ir: درخواست‌های امروز

source: Total Products
fa_ir: کل محصولات

source: Cache Entries
fa_ir: ورودی‌های کش

source: Recent Logs
fa_ir: لاگ‌های اخیر

source: Refresh
fa_ir: بروزرسانی

source: Clear Logs
fa_ir: پاک کردن لاگ‌ها

source: All Requests
fa_ir: همه درخواست‌ها

source: Successful
fa_ir: موفق

source: Error
fa_ir: خطا

source: Time
fa_ir: زمان

source: Status
fa_ir: وضعیت

source: Previous
fa_ir: قبلی

source: Next
fa_ir: بعدی

source: No logs found
fa_ir: هیچ لاگی یافت نشد

source: Page %d of %d
fa_ir: صفحه %d از %d

source: Example: 123
fa_ir: مثال: ۱۲۳

source: Product numeric ID
fa_ir: شناسه عددی محصول

source: Example: 1
fa_ir: مثال: ۱

source: Page number (default: 1)
fa_ir: شماره صفحه (پیش‌فرض: ۱)

source: Example: 10
fa_ir: مثال: ۱۰

source: Products per page (max: 100)
fa_ir: تعداد محصولات در هر صفحه (حداکثر: ۱۰۰)

source: Show product variations
fa_ir: نمایش تنوعات محصولات

source: Example: 1,2,3,4
fa_ir: مثال: ۱،۲،۳،۴

source: Product IDs separated by comma
fa_ir: شناسه‌های محصولات جدا شده با کاما

source: Example: product-1,product-2
fa_ir: مثال: محصول-۱،محصول-۲

source: Product slugs separated by comma
fa_ir: نام‌های محصولات جدا شده با کاما

source: Invalid title template syntax
fa_ir: نحو قالب عنوان نامعتبر است

source: Configuration saved successfully
fa_ir: تنظیمات با موفقیت ذخیره شد

source: Failed to save configuration
fa_ir: ذخیره تنظیمات با خطا مواجه شد

source: Settings reset to defaults
fa_ir: تنظیمات به حالت پیش‌فرض بازگردانده شد

source: Server connection error
fa_ir: خطا در ارتباط با سرور

source: Access denied
fa_ir: دسترسی مجاز نیست

source: Invalid request parameters
fa_ir: پارامترهای درخواست نامعتبر

source: Product not found
fa_ir: محصول یافت نشد

source: Cache error
fa_ir: خطای کش

source: Database error
fa_ir: خطای پایگاه داده

source: Rate limit exceeded
fa_ir: محدودیت نرخ درخواست تجاوز شده

source: Request timeout
fa_ir: مهلت زمانی درخواست تمام شد

source: Cache cleared successfully
fa_ir: کش با موفقیت پاک شد

source: Statistics updated
fa_ir: آمار بروزرسانی شد

source: Logs cleared successfully
fa_ir: لاگ‌ها با موفقیت پاک شدند

source: Test completed successfully
fa_ir: تست با موفقیت انجام شد

source: Today
fa_ir: امروز

source: Yesterday
fa_ir: دیروز

source: This Week
fa_ir: این هفته

source: This Month
fa_ir: این ماه

source: Last 30 Days
fa_ir: ۳۰ روز گذشته

source: All Time
fa_ir: همه زمان‌ها

source: seconds
fa_ir: ثانیه

source: minutes
fa_ir: دقیقه

source: hours
fa_ir: ساعت

source: days
fa_ir: روز

source: bytes
fa_ir: بایت

source: KB
fa_ir: کیلوبایت

source: MB
fa_ir: مگابایت

source: GB
fa_ir: گیگابایت

source: Skip to main content
fa_ir: پرش به محتوای اصلی

source: Main navigation
fa_ir: ناوبری اصلی

source: Settings form
fa_ir: فرم تنظیمات

source: Loading...
fa_ir: در حال بارگذاری...

source: Please wait
fa_ir: لطفاً صبر کنید

source: Processing request
fa_ir: در حال پردازش درخواست

source: Need help?
fa_ir: کمک نیاز دارید؟

source: Documentation
fa_ir: مستندات

source: Support
fa_ir: پشتیبانی

source: Contact Us
fa_ir: تماس با ما

source: Version
fa_ir: نسخه

source: Last Updated
fa_ir: آخرین بروزرسانی

source: AI Assistant
fa_ir: دستیار هوشمند

source: Smart Assistant
fa_ir: دستیار هوشمند

source: Current Subscription: %s
fa_ir: اشتراک فعلی: %s

source: Upgrade Plan
fa_ir: ارتقای پلن

source: Free
fa_ir: رایگان

source: Basic
fa_ir: پایه

source: Pro
fa_ir: حرفه‌ای

source: Enterprise
fa_ir: سازمانی

source: General Settings
fa_ir: تنظیمات عمومی

source: LLM Configuration
fa_ir: پیکربندی مدل زبانی

source: Analysis Settings
fa_ir: تنظیمات تحلیل

source: Automation
fa_ir: اتوماسیون

source: Notifications
fa_ir: اعلان‌ها

source: Enable Module
fa_ir: فعال‌سازی ماژول

source: Enable or disable the AI Sales Agent module
fa_ir: فعال یا غیرفعال کردن ماژول دستیار فروش هوشمند

source: LLM Provider
fa_ir: ارائه‌دهنده مدل زبانی

source: Select your LLM provider
fa_ir: ارائه‌دهنده مدل زبانی خود را انتخاب کنید

source: LLM Endpoint
fa_ir: آدرس API مدل زبانی

source: API endpoint URL for your LLM provider
fa_ir: آدرس URL نقطه پایانی API ارائه‌دهنده مدل زبانی

source: API Key
fa_ir: کلید API

source: Your LLM provider API key
fa_ir: کلید API ارائه‌دهنده مدل زبانی شما

source: Model Name
fa_ir: نام مدل

source: LLM model to use
fa_ir: مدل زبانی مورد استفاده

source: Temperature
fa_ir: دما

source: Controls randomness in responses (0-1)
fa_ir: کنترل تصادفی بودن پاسخ‌ها (۰-۱)

source: Max Tokens
fa_ir: حداکثر توکن

source: Maximum tokens in response
fa_ir: حداکثر توکن در پاسخ

source: Timeout in seconds for LLM requests
fa_ir: مهلت زمانی به ثانیه برای درخواست‌های مدل زبانی

source: Analysis Frequency
fa_ir: تناوب تحلیل

source: How often to run automatic analysis
fa_ir: هر چند وقت یکبار تحلیل خودکار اجرا شود

source: Daily
fa_ir: روزانه

source: Twice Daily
fa_ir: دو بار در روز

source: Weekly
fa_ir: هفتگی

source: Products per Batch
fa_ir: محصولات در هر دسته

source: Number of products to analyze per batch
fa_ir: تعداد محصولات برای تحلیل در هر دسته

source: Customers per Batch
fa_ir: مشتریان در هر دسته

source: Number of customers to analyze per batch
fa_ir: تعداد مشتریان برای تحلیل در هر دسته

source: Minimum Confidence
fa_ir: حداقل اطمینان

source: Minimum confidence score for recommendations
fa_ir: حداقل امتیاز اطمینان برای پیشنهادات

source: Auto Execute
fa_ir: اجرای خودکار

source: Automatically execute approved actions
fa_ir: اجرای خودکار اقدامات تأیید شده

source: Require Approval
fa_ir: نیاز به تأیید

source: Require manual approval for actions
fa_ir: نیاز به تأیید دستی برای اقدامات

source: Allowed Action Types
fa_ir: انواع اقدامات مجاز

source: Types of actions the AI can suggest
fa_ir: انواع اقداماتی که هوش مصنوعی می‌تواند پیشنهاد دهد

source: Price Adjustment
fa_ir: تنظیم قیمت

source: Inventory Alert
fa_ir: هشدار موجودی

source: Promotion Suggestion
fa_ir: پیشنهاد تخفیف

source: Customer Outreach
fa_ir: ارتباط با مشتری

source: Product Bundling
fa_ir: بسته‌بندی محصول

source: Active Hours
fa_ir: ساعات فعال

source: Hours when automation is active
fa_ir: ساعاتی که اتوماسیون فعال است

source: Email Notifications
fa_ir: اعلان‌های ایمیل

source: Send email notifications for important events
fa_ir: ارسال اعلان ایمیل برای رویدادهای مهم

source: Notification Email
fa_ir: ایمیل اعلان

source: Email address for notifications
fa_ir: آدرس ایمیل برای اعلان‌ها

source: Daily Summary
fa_ir: خلاصه روزانه

source: Send daily summary email
fa_ir: ارسال ایمیل خلاصه روزانه

source: Alert on High Priority
fa_ir: هشدار برای اولویت بالا

source: Send immediate alerts for high priority actions
fa_ir: ارسال هشدار فوری برای اقدامات با اولویت بالا

source: Test LLM Connection
fa_ir: تست اتصال LLM

source: Run Analysis
fa_ir: اجرای تحلیل

source: Testing...
fa_ir: در حال تست...

source: Analyzing...
fa_ir: در حال تحلیل...

source: Connection successful
fa_ir: اتصال موفق

source: Connection failed
fa_ir: اتصال ناموفق

source: Analysis completed successfully
fa_ir: تحلیل با موفقیت انجام شد

source: Analysis failed
fa_ir: تحلیل ناموفق

source: Requires upgrade
fa_ir: نیاز به ارتقا

source: AI Agent module enabled
fa_ir: ماژول دستیار هوشمند فعال شد

source: AI Agent module disabled
fa_ir: ماژول دستیار هوشمند غیرفعال شد

source: Settings saved successfully
fa_ir: تنظیمات با موفقیت ذخیره شد

source: Unauthorized
fa_ir: غیرمجاز

source: No settings provided
fa_ir: تنظیماتی ارائه نشده

source: %d settings saved successfully
fa_ir: %d تنظیم با موفقیت ذخیره شد

source: Some settings could not be saved
fa_ir: برخی تنظیمات ذخیره نشدند

source: %d settings imported successfully
fa_ir: %d تنظیم با موفقیت وارد شد

source: Some settings could not be imported
fa_ir: برخی تنظیمات وارد نشدند

source: No settings data provided
fa_ir: داده تنظیماتی ارائه نشده

source: AI Agent Dashboard
fa_ir: داشبورد دستیار هوشمند

source: Pending Actions
fa_ir: اقدامات در انتظار

source: Completed Actions
fa_ir: اقدامات انجام شده

source: Success Rate
fa_ir: نرخ موفقیت

source: Total Analyses
fa_ir: کل تحلیل‌ها

source: Products Analyzed
fa_ir: محصولات تحلیل شده

source: Customers Analyzed
fa_ir: مشتریان تحلیل شده

source: Last Analysis
fa_ir: آخرین تحلیل

source: Next Scheduled
fa_ir: زمان‌بندی بعدی

source: Action ID
fa_ir: شناسه اقدام

source: Action Type
fa_ir: نوع اقدام

source: Priority
fa_ir: اولویت

source: Created At
fa_ir: تاریخ ایجاد

source: Approve
fa_ir: تأیید

source: Execute
fa_ir: اجرا

source: Cancel
fa_ir: لغو

source: View Details
fa_ir: مشاهده جزئیات

source: No actions found
fa_ir: اقدامی یافت نشد

source: Action approved
fa_ir: اقدام تأیید شد

source: Action executed
fa_ir: اقدام اجرا شد

source: Action cancelled
fa_ir: اقدام لغو شد

source: System Health
fa_ir: سلامت سیستم

source: LLM Connection
fa_ir: اتصال LLM

source: Healthy
fa_ir: سالم

source: Warning
fa_ir: هشدار

source: Critical
fa_ir: بحرانی

source: Unknown
fa_ir: نامشخص

source: AI Agent Module Status
fa_ir: وضعیت ماژول دستیار هوشمند

source: Enabled
fa_ir: فعال

source: Disabled
fa_ir: غیرفعال

source: Yes
fa_ir: بله

source: No
fa_ir: خیر

source: Running analysis...
fa_ir: در حال اجرای تحلیل...

source: Analysis completed
fa_ir: تحلیل انجام شد

source: Database migrations completed
fa_ir: مهاجرت‌های پایگاه داده انجام شد

source: Cleaned up %d old records
fa_ir: %d رکورد قدیمی پاک شد

source: Free Tier
fa_ir: پلن رایگان

source: Basic Tier
fa_ir: پلن پایه

source: Pro Tier
fa_ir: پلن حرفه‌ای

source: Enterprise Tier
fa_ir: پلن سازمانی

source: Upgrade to unlock this feature
fa_ir: برای باز کردن این قابلیت ارتقا دهید

source: Feature available in %s plan
fa_ir: این قابلیت در پلن %s موجود است

source: An error occurred
fa_ir: خطایی رخ داد

source: Operation completed successfully
fa_ir: عملیات با موفقیت انجام شد

source: Are you sure?
fa_ir: آیا مطمئن هستید؟

source: Analysis running...
fa_ir: تحلیل در حال اجرا...

source: Server communication error
fa_ir: خطا در ارتباط با سرور

source: Save AI Agent Settings
fa_ir: ذخیره تنظیمات دستیار هوشمند

source: Error saving settings
fa_ir: خطا در ذخیره تنظیمات

source: Are you sure you want to reset AI Agent settings to defaults?
fa_ir: آیا مطمئن هستید که می‌خواهید تنظیمات دستیار هوشمند را به حالت پیش‌فرض بازگردانید؟
